ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/TIMA0_1_1.0.xml
        <register id="TIMA0_1_RCLD" width="32" offset="0xB8" description="Repeat counter load Register">
            <bitfield id="RCLD" description="Repeat Counter Load Value
This field provides the value loaded into the
repeat counter at a load event following the
repeat counter value equaling 0." begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMA0_1_FCTL" width="32" offset="0xD0" description="Fault Control Register">
            <bitfield id="FIEN" description="Fault Input Enable
This bit enables the input for fault detection." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Fault Input Disabled"/>
                <bitenum id="ENABLED" value="0x1" description="Fault Input Enabled"/>
            </bitfield>
            <bitfield id="FI" description="Fault Input
Specifies whether the overall fault condition is dependent on the sensed fault pin." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="INDEPENDENT" value="0x0" description="Overall Fault condition is not dependent on sensed input."/>
                <bitenum id="DEPENDENT" value="0x1" description="Overall Fault condition is dependent on sensed input."/>
            </bitfield>
            <bitfield id="TFIM" description="Trigger Fault Input Mask
Specifies whether the selected trigger participates as a fault input. If enabled and the trigger asserts, the trigger is treated as a fault." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Selected trigger does not participate in fault condition generation"/>
                <bitenum id="ENABLED" value="0x1" description="Selected trigger participates in fault condition generation"/>
            </bitfield>
            <bitfield id="FL" description="Fault Latch mode
Specifies whether the fault condition is latched and configures the latch clear conditions." begin="4" end="3" width="2" rwaccess="R/W">
                <bitenum id="NO_LATCH" value="0x0" description="Overall fault condition is not dependent on the F bit in RIS"/>
                <bitenum id="LATCH_SW_CLR" value="0x1" description="Overall fault condition is dependent on the F bit in RIS"/>
                <bitenum id="LATCH_Z_CLR" value="0x2" description="Fault condition is latched. Fault condition is cleared on a zero event if the fault input is 0."/>
                <bitenum id="LATCH_LD_CLR" value="0x3" description="Fault condition is latched. Fault condition is cleared on a load event if the fault input is 0."/>
            </bitfield>
            <bitfield id="FSENAC0" description="Specifies whether the COMP0 output high/low is treated as fault condition." begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENAC1" description="Specifies whether the COMP1 output high/low is treated as fault condition." begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENAC2" description="Specifies whether the COMP2 output high/low is treated as fault condition." begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENEXT0" description="Specifies whether the external fault pin0 high/low is treated as fault condition." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENEXT1" description="Specifies whether the external fault pin1 high/low is treated as fault condition." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENEXT2" description="Specifies whether the external fault pin2 high/low is treated as fault condition." begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
        </register>
        <register id="TIMA0_1_FIFCTL" width="32" offset="0xD4" description="Fault input Filter control register">
            <bitfield id="FP" description="Filter Period
This field specifies the sample period for the input filter.  I.e. The input is sampled for FP timer clocks during filtering." begin="1" end="0" width="2" rwaccess="R/W">
                <bitenum id="PER_3" value="0x0" description="Filter Period 3"/>
                <bitenum id="PER_5" value="0x1" description="Filter Period 5"/>
                <bitenum id="PER_8" value="0x2" description="Filter Period 8"/>
            </bitfield>
            <bitfield id="CPV" description="Consecutive Period/Voting Select
This bit controls whether the input filter uses a stricter consecutive period count or majority voting." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CONSEC_PER" value="0x0" description="Consecutive Periods. The input must be at a specific logic level for the period defined by FP before it is passed to the filter output."/>
                <bitenum id="VOTING" value="0x1" description="Voting. The filter ignores one clock of opposite logic over the filter period. I.e. Over FP samples of the input, up to 1 sample may be of an opposite logic value (glitch) without affecting the output"/>
            </bitfield>
            <bitfield id="FILTEN" description="Filter Enable
This bit controls whether the input is filtered by the input filter or bypasses to go directly to the optional pre-scale filter and then to the edge detect." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="BYPASS" value="0x0" description="Bypass"/>
                <bitenum id="FILTERED" value="0x1" description="Filtered."/>
            </bitfield>
        </register>
        </group>

</module>